/*
- 다이얼

전화를 걸고 싶은 번호가 있다면, 
숫자를 하나를 누른 다음에 금속 핀이 있는 곳 까지 시계방향으로 돌려야 한다. 
숫자를 하나 누르면 다이얼이 처음 위치로 돌아가고, 
다음 숫자를 누르려면 다이얼을 처음 위치에서 다시 돌려야 한다.

숫자 1을 걸려면 총 2초가 필요하다. 
1보다 큰 수를 거는데 걸리는 시간은 이보다 더 걸리며, 
한 칸 옆에 있는 숫자를 걸기 위해선 1초씩 더 걸린다.

상근이의 할머니는 전화 번호를 각 숫자에 해당하는 문자로 외운다. 
즉, 어떤 단어를 걸 때, 각 알파벳에 해당하는 숫자를 걸면 된다. 

예를 들어, UNUCIC는 868242와 같다.
이 전화를 걸기 위해서 필요한 최소 시간을 구하는 프로그램을 작성하시오.

[입력]
WA

UNUCIC

[출력]
13

36
*/

const fs = require('fs');
const input = fs.readFileSync("input.txt").toString().trim().split(/\s+/);
const dial = {
    "A": 2, "B": 2, "C": 2, "D": 3, "E": 3,
    "F": 3, "G": 4, "H": 4, "I": 4, "J": 5,
    "K": 5, "L": 5, "M": 6, "N": 6, "O": 6,
    "P": 7, "Q": 7, "R": 7, "S": 7, "T": 8,
    "U": 8, "V": 8, "W": 9, "X": 9, "Y": 9,
    "Z": 9
}
const totalTime = input[0].split("").map(
    num => dial[num] + 1).reduce((acc, cur) => acc + cur);

console.log(totalTime);

/*
- map과 reduce는 보통 같이 쓸 일이 많음
*/